9/data/attachments/ad6a92fbb6ecad56.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_820e7bf3-842a-4ec0-b85a-397ac4407f7d</nif:username>
            <nif:friendToBeAdded>Paul_continue_Friend_98356_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>